alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE987x.svd
				<register>
					<name>P1_POCON1</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0FC</addressOffset>
					<size>8</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM3</name>
							<description>P1.3 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM2</name>
							<description>P1.2 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON2</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x100</addressOffset>
					<size>8</size>
					<resetValue>0x04</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM4</name>
							<description>P1.4 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCR</name>
					<description>Temperature Compensation Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F4</addressOffset>
					<size>8</size>
					<resetValue>0x03</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>TCC</name>
							<description>Temperature Compensation Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TJ: -40 oC to 0 oC</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TJ: 0 oC to 40 oC</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>TJ: 40 oC to 80 oC</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>TJ: 80 oC to 150 oC</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT12PISEL</name>
					<description>GPT12 Peripheral Input Select Register, RESET_TYPE_3</description>
					<addressOffset>0x0D0</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T3_GPT12_SEL</name>
							<description>CCU6_INT_SEL.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU6_INT is triggered by Timer 3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU6_INT is triggered by GPT12PISEL.GPT12.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIG_CONF</name>
							<description>CCU6 Trigger Configuration.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trigger is just for one measurement (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trigger is present until next input edge (selected by GPT12) - continuos measurement.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12</name>
							<description>GPT12 TIN3B / TIN4D Input Select</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC60</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC61</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CC62</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>T12 ZM.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>T12 PM.</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>T12 CM0.</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>T12 CM1.</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>T12 CM2.</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>T13 PM.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>T13 ZM.</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>T13 CM.</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>any pos or neg edge on CC60/61/62.</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>RES.</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>RES.</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>RES.</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>RES.</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON1</name>
					<description>Peripheral Management Control Register 1, RESET_TYPE_3</description>
					<addressOffset>0x060</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>GPT12_DIS</name>
							<description>General Purpose Timer 12 Disable Request. Active high.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>GPT12is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the GPT12.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_DIS</name>
							<description>T2 Disable Request. Active high.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T2 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6_DIS</name>
							<description>CCU6 Disable Request. Active high.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU6 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the CCU6.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC1_DIS</name>
							<description>SSC1 Disable Request. Active high.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SSC is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the SSC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_DIS</name>
							<description>ADC1 Disable Request. Active high.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ADC1 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the ADC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON2</name>
					<description>Peripheral Management Control Register 2, RESET_TYPE_3</description>
					<addressOffset>0x064</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T3_DIS</name>
							<description>T3 Disable Request. Active high.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T3is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T3.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21_DIS</name>
							<description>T21 Disable Request. Active high.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T21 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T21.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC2_DIS</name>
							<description>SSC2 Disable Request. Active high.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SSC is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the SSC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODSUSP1</name>
					<description>Module Suspend Control Register 1, RESET_TYPE_3</description>
					<addressOffset>0x0C8</addressOffset>
					<size>8</size>
					<resetValue>0x81</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T21_SUSP</name>
							<description>Timer21 Debug Suspend Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer21 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer21 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12_SUSP</name>
							<description>GPT12 Debug Suspend Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>GPT12 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>GPT12 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_SUSP</name>
							<description>Timer2 Debug Suspend Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer2 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer2 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13SUSP</name>
							<description>Timer 13 Debug Suspend Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 13 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 13 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12SUSP</name>
							<description>Timer 12 Debug Suspend Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 12 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 12 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTSUSP</name>
							<description>SCU Watchdog Timer Debug Suspend Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>WDT will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>WDT will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODSUSP2</name>
					<description>Module Suspend Control Register 2, RESET_TYPE_3</description>
					<addressOffset>0x0CC</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>ADC1_SUSP</name>
							<description>ADC1 Unit Debug Suspend Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ADC1 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ADC1 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MU_SUSP</name>
							<description>Measurement Unit Debug Suspend Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MU will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MU will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_SUSP</name>
							<description>Measurement Unit Debug Suspend Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 3 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 3 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
