alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE987x.svd
				<register>
					<name>FILTCOEFF0_5</name>
					<description>Filter Coefficients ADC Channel 0-5</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<resetValue>0x00000AAA</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH5</name>
							<description>Filter Coefficients ADC channel 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Filter Coefficients ADC channel 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Filter Coefficients ADC channel 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Filter Coefficients ADC channel 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Filter Coefficients ADC channel 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0</name>
							<description>Filter Coefficients ADC channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILTCOEFF6_9</name>
					<description>Filter Coefficents ADC Channel 6-9</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<resetValue>0x000000D5</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH9</name>
							<description>Filter Coefficients ADC channel 9</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Filter Coefficients ADC channel 8</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Filter Coefficients ADC channel 7</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Filter Coefficients ADC channel 6</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT0</name>
					<description>ADC or Filter Output Channel 0</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH0</name>
							<description>ADC or filter output value channel 0</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT1</name>
					<description>ADC or Filter Output Channel 1</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH1</name>
							<description>ADC or filter output value channel 1</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT2</name>
					<description>ADC or Filter Output Channel 2</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH2</name>
							<description>ADC or filter output value channel 2</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT3</name>
					<description>ADC or Filter Output Channel 3</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH3</name>
							<description>ADC or filter output value channel 3</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT4</name>
					<description>ADC or Filter Output Channel 4</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH4</name>
							<description>ADC or filter output value channel 4</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT5</name>
					<description>ADC or Filter Output Channel 5</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH5</name>
							<description>ADC or filter output value channel 5</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT6</name>
					<description>ADC or Filter Output Channel 6</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH6</name>
							<description>ADC or filter output value channel 6</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT7</name>
					<description>ADC or Filter Output Channel 7</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH7</name>
							<description>ADC or filter output value channel 7</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT8</name>
					<description>ADC or Filter Output Channel 8</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH8</name>
							<description>ADC or filter output value channel 8</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT9</name>
					<description>ADC or Filter Output Channel 9</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<resetValue>#00000000000000000000000000000000</resetValue>
					<resetMask>#11111111111111111111110000000000</resetMask>
					<fields>
						<field>
							<name>OUT_CH9</name>
							<description>ADC or filter output value channel 9</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_UP_CTRL</name>
					<description>Upper Threshold Filter Enable</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<resetValue>0x00000F3F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Ch5_EN</name>
							<description>Upper threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch4_EN</name>
							<description>Upper threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch3_EN</name>
							<description>Upper threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch2_EN</name>
							<description>Upper threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch1_EN</name>
							<description>Upper threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch0_EN</name>
							<description>Upper threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_LO_CTRL</name>
					<description>Lower Threshold Filter Enable</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<resetValue>0x00000F3F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Ch5_EN</name>
							<description>Lower threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch4_EN</name>
							<description>Lower threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch3_EN</name>
							<description>Lower threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch2_EN</name>
							<description>Lower threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch1_EN</name>
							<description>Lower threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch0_EN</name>
							<description>Lower threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
