alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE987x.svd
				<register>
					<name>MMODE0_5</name>
					<description>Overvoltage Measurement Mode of Ch 0-5</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Ch5</name>
							<description>Measurement mode ch 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch4</name>
							<description>Measurement mode ch 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch3</name>
							<description>Measurement mode ch 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch2</name>
							<description>Measurement mode ch 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch1</name>
							<description>Measurement mode ch 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Ch0</name>
							<description>Measurement mode ch 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper &amp; lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 0-3</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<resetValue>0xA8ABDAE2</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH3</name>
							<description>Channel 3 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0</name>
							<description>Channel 0 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH4_5_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 4 -5</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<resetValue>0x0000BC42</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH5</name>
							<description>Channel 5 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH6_9_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 6 -9</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<resetValue>0xE2FAC6EE</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH9</name>
							<description>Channel 9 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>min. threshold value = 0</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>max. threshold value = 255</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT0_3_UPPER</name>
					<description>Upper Counter Trigger Level Channel 0 - 3</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<resetValue>0x12131B1A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HYST_UP_CH3</name>
							<description>Channel 3 upper hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH3</name>
							<description>Upper timer trigger threshold channel 3</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH2</name>
							<description>Channel 2 upper hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH2</name>
							<description>Upper timer trigger threshold channel 2</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH1</name>
							<description>Channel 1 upper hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH1</name>
							<description>Upper timer trigger threshold channel 1</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_CH0</name>
							<description>Channel 0 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH0</name>
							<description>Upper timer trigger threshold channel 0</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>16 measurements</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>32 measurements</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>64 measurements</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>128 measurements</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
