alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/TLE987x.svd
				<register>
					<name>OFF_SEQ_CTRL</name>
					<description>Turn on Slewrate Sequencer Control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_OFF_I_1</name>
							<description>Slew rate sequencer off phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_1</name>
							<description>Slew rate sequencer off phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_2</name>
							<description>Slew rate sequencer off phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_2</name>
							<description>Slew rate sequencer off phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_3</name>
							<description>Slew rate sequencer off phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_3</name>
							<description>Slew rate sequencer off phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_I_4</name>
							<description>Slew rate sequencer off phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_OFF_t_4</name>
							<description>Slew rate sequencer off phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ON_SEQ_CTRL</name>
					<description>Turn off Slewrate Sequencer Control</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRV_ON_I_1</name>
							<description>Slew rate sequencer on phase 1 current</description>
							<lsb>27</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_1</name>
							<description>Slew rate sequencer on phase 1 time</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_2</name>
							<description>Slew rate sequencer on phase 2 current</description>
							<lsb>19</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_2</name>
							<description>Slew rate sequencer on phase 2 time</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_3</name>
							<description>Slew rate sequencer on phase 3 current</description>
							<lsb>11</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_3</name>
							<description>Slew rate sequencer on phase 3 time</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_I_4</name>
							<description>Slew rate sequencer on phase 4 current</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Slew Rate Control is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Maximum</name>
									<description>maximum output discharge current</description>
									<value>0x1f</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_ON_t_4</name>
							<description>Slew rate sequencer on phase 4 time</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400ns</name>
									<description>400ns phase duration</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIM_DRVx</name>
					<description>Trimming of Driver</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CPLOW_TFILT_SEL</name>
							<description>Filter Time for Charge Pump Voltage Low Diagnosis</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS3DRV_OCSDN_DIS</name>
							<description>High Side 3 Predriver in overcurrent situation disable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2DRV_OCSDN_DIS</name>
							<description>High Side 2 Predriver in overcurrent situation disable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1DRV_OCSDN_DIS</name>
							<description>High Side 1 Predriver in overcurrent situation disable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS3DRV_FDISCHG_DIS</name>
							<description>High Side 3 Predriver in overcurrent situation disable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2DRV_FDISCHG_DIS</name>
							<description>High Side 2 Predriver in overcurrent situation disable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1DRV_FDISCHG_DIS</name>
							<description>High Side 1 Predriver in overcurrent situation disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSDRV_DS_TFILT_SEL</name>
							<description>Filter Time for Drain-Source Monitoring of High Side Drivers</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS3DRV_OCSDN_DIS</name>
							<description>Low Side 3 Predriver in overcurrent situation disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2DRV_OCSDN_DIS</name>
							<description>Low Side 2 Predriver in overcurrent situation disable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1DRV_OCSDN_DIS</name>
							<description>Low Side 1 Predriver in overcurrent situation disable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS3DRV_FDISCHG_DIS</name>
							<description>Low Side 3 Predriver in overcurrent situation disable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2DRV_FDISCHG_DIS</name>
							<description>Low Side 2 Predriver in overcurrent situation disable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1DRV_FDISCHG_DIS</name>
							<description>Low Side 1 Predriver in overcurrent situation disable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSDRV_DS_TFILT_SEL</name>
							<description>Filter Time for Drain-Source Monitoring of Low Side Drivers</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS_HS_BT_TFILT_SEL</name>
							<description>Blanking Time for Drain-Source Monitoring of Low / High Side Drivers</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
